RT-Thread/rt-thread/bsp/efm32/drv_usart.c
/***************************************************************************//**
 * @file 	drv_usart.c
 * @brief 	USART driver of RT-Thread RTOS for EFM32
 * 	COPYRIGHT (C) 2011, RT-Thread Development Team
 * @author 	onelife
 * @version 0.4 beta
 *******************************************************************************
 * @section License
 * The license and distribution terms for this file may be found in the file
 *  LICENSE in this distribution or at http://www.rt-thread.org/license/LICENSE
 *******************************************************************************
 * @section Change Logs of serial.c
 * Date			Author		Notes
 * 2009-02-05	Bernard		first version
 * 2009-10-25	Bernard		fix rt_serial_read bug when there is no data in the
 *  buffer.
 * 2010-03-29	Bernard		cleanup code.
 *
 * @section Change Logs
 * Date			Author		Notes
 * 2010-12-22	onelife		Initial creation for EFM32
 * 2011-01-17	onelife		Merge with serial.c
 * 2011-05-06	onelife		Add sync mode (SPI) support
 * 2011-06-14	onelife		Fix a bug of TX by DMA
 * 2011-06-16	onelife		Modify init function for EFM32 library v2.0.0
 *  upgrading
 * 2011-07-07	onelife		Modify write function to avoid sleep in ISR
 * 2011-07-26	onelife		Add lock (semaphore) to prevent simultaneously
 *  access
 * 2011-11-29	onelife		Modify init function for EFM32 library v2.2.2
 *  upgrading
 * 2011-12-09	onelife		Add giant gecko support
 * 2011-12-09   onelife     Add UART module support
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup efm32
 * @{
 ******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "board.h"
#include "hdl_interrupt.h"
#include "drv_usart.h"

#if (defined(RT_USING_USART0) || defined(RT_USING_USART1) || \
    defined(RT_USING_USART2) || defined(RT_USING_UART0) || \
    defined(RT_USING_UART1))
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#ifdef RT_USART_DEBUG
#define usart_debug(format,args...) 		rt_kprintf(format, ##args)
#else
#define usart_debug(format,args...)
#endif

/* Private variables ---------------------------------------------------------*/
#ifdef RT_USING_USART0
#if (RT_USING_USART0 >= EFM32_USART_LOCATION_COUNT)
	#error "Wrong location number"
#endif
	struct rt_device usart0_device;
	static struct rt_semaphore usart0_lock;
#endif

#ifdef RT_USING_USART1
#if (RT_USING_USART1 >= EFM32_USART_LOCATION_COUNT)
	#error "Wrong location number"
#endif
	struct rt_device usart1_device;
	static struct rt_semaphore usart1_lock;
#endif

#ifdef RT_USING_USART2
#if (RT_USING_USART2 >= EFM32_USART_LOCATION_COUNT)
	#error "Wrong location number"
#endif
	struct rt_device usart2_device;
	static struct rt_semaphore usart2_lock;
#endif

#ifdef RT_USING_UART0
#if (RT_USING_UART0 >= EFM32_UART_LOCATION_COUNT)
	#error "Wrong location number"
#endif
	struct rt_device uart0_device;
	static struct rt_semaphore uart0_lock;
#endif

#ifdef RT_USING_UART1
#if (RT_USING_UART1 >= EFM32_UART_LOCATION_COUNT)
	#error "Wrong location number"
#endif
	struct rt_device uart1_device;
	static struct rt_semaphore uart1_lock;
#endif


/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/***************************************************************************//**
 * @brief
 *   Initialize USART device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t rt_usart_init (rt_device_t dev)
{
	struct efm32_usart_device_t *usart;

	usart = (struct efm32_usart_device_t *)(dev->user_data);

	if (!(dev->flag & RT_DEVICE_FLAG_ACTIVATED))
	{
		if (dev->flag & RT_DEVICE_FLAG_DMA_TX)
		{
			struct efm32_usart_dma_mode_t *dma_tx;

			dma_tx = (struct efm32_usart_dma_mode_t *)(usart->tx_mode);

			usart->state |= USART_STATE_RX_BUSY;
		}

		if (dev->flag & RT_DEVICE_FLAG_INT_RX)
		{
			struct efm32_usart_int_mode_t *int_rx;

			int_rx = (struct efm32_usart_int_mode_t *)(usart->rx_mode);

			int_rx->data_ptr = RT_NULL;
		}

		/* Enable USART */
		USART_Enable(usart->usart_device, usartEnable);

		dev->flag |= RT_DEVICE_FLAG_ACTIVATED;
	}

	return RT_EOK;
}

/***************************************************************************//**
 * @brief
 *   Open USART device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] oflag
 *   Device open flag
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t rt_usart_open(rt_device_t dev, rt_uint16_t oflag)
{
	RT_ASSERT(dev != RT_NULL);

	struct efm32_usart_device_t	*usart;

	usart = (struct efm32_usart_device_t *)(dev->user_data);

	if (dev->flag & RT_DEVICE_FLAG_INT_RX)
	{
		IRQn_Type 					rxIrq;

		//if (usart->state & USART_STATE_CONSOLE)
		{	/* Allocate new RX buffer */
			struct efm32_usart_int_mode_t	*int_mode;

			int_mode = (struct efm32_usart_int_mode_t *)(usart->rx_mode);

			if ((int_mode->data_ptr = rt_malloc(USART_RX_BUFFER_SIZE)) == RT_NULL)
			{
				usart_debug("USART%d err: no mem for RX BUF\n", usart->unit);
				return -RT_ENOMEM;
			}
			rt_memset(int_mode->data_ptr, 0, USART_RX_BUFFER_SIZE);
			int_mode->data_size = USART_RX_BUFFER_SIZE;
			int_mode->read_index = 0;
			int_mode->save_index = 0;
		}

		/* Enable RX interrupt */
        if (usart->state & USART_STATE_ASYNC_ONLY)
        {
            usart->usart_device->IEN 	= UART_IEN_RXDATAV;
        }
        else
        {
            usart->usart_device->IEN    = USART_IEN_RXDATAV;
        }

		/* Enable IRQ */
		switch (usart->unit)
		{
		case 0:
            if (usart->state & USART_STATE_ASYNC_ONLY)
            {
    			rxIrq   = UART0_RX_IRQn;
            }
            else
            {
    			rxIrq   = USART0_RX_IRQn;
            }
			break;
		case 1:
#if defined(EFM32_GIANT_FAMILY)
            if (usart->state & USART_STATE_ASYNC_ONLY)
            {
    			rxIrq   = UART1_RX_IRQn;
            }
            else
#endif
            {
    			rxIrq   = USART1_RX_IRQn;
            }
			break;
		case 2:
			rxIrq		= USART2_RX_IRQn;
			break;
		}
		if (oflag != RT_DEVICE_OFLAG_WRONLY)
		{
			NVIC_ClearPendingIRQ(rxIrq);
			NVIC_SetPriority(rxIrq, EFM32_IRQ_PRI_DEFAULT);
			NVIC_EnableIRQ(rxIrq);
		}
	}

    /* Clear Flag */
    if (usart->state & USART_STATE_ASYNC_ONLY)
    {
        usart->usart_device->IFC    = _UART_IFC_MASK;
    }
    else
    {
    	usart->usart_device->IFC    = _USART_IFC_MASK;
    }

	if ((dev->flag & RT_DEVICE_FLAG_DMA_TX) && (oflag != RT_DEVICE_OFLAG_RDONLY))
	{
		/* DMA IRQ is enabled by DMA_Init() */
		NVIC_SetPriority(DMA_IRQn, EFM32_IRQ_PRI_DEFAULT);
	}

	usart->counter++;
	usart_debug("USART%d: Open with flag %x\n", usart->unit, oflag);
	return RT_EOK;
}

/***************************************************************************//**
 * @brief
 *   Close USART device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @return
 *   Error code
 ******************************************************************************/
static rt_err_t rt_usart_close(rt_device_t dev)
{
	RT_ASSERT(dev != RT_NULL);

