RT-Thread/rt-thread/bsp/efm32/drv_usart.c
	struct efm32_usart_device_t	*usart;

	usart = (struct efm32_usart_device_t *)(dev->user_data);

	if (--usart->counter == 0)
	{
		if (dev->flag & RT_DEVICE_FLAG_INT_RX)
		{
			struct efm32_usart_int_mode_t *int_rx;

			int_rx = (struct efm32_usart_int_mode_t *)usart->rx_mode;

			rt_free(int_rx->data_ptr);
			int_rx->data_ptr = RT_NULL;
		}
	}

	return RT_EOK;
}

/***************************************************************************//**
 * @brief
 *   Read from USART device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] pos
 *   Offset
 *
 * @param[in] buffer
 *   Poniter to the buffer
 *
 * @param[in] size
 *   Buffer size in byte
 *
 * @return
 *   Number of read bytes
 ******************************************************************************/
static rt_size_t rt_usart_read (
	rt_device_t 	dev,
	rt_off_t 		pos,
	void 			*buffer,
	rt_size_t 		size)
{
	struct efm32_usart_device_t *usart;
	rt_uint8_t 	*ptr;
	rt_err_t 	err_code;
	rt_size_t 	read_len;

	usart = (struct efm32_usart_device_t *)(dev->user_data);

	/* Lock device */
	if (rt_hw_interrupt_check())
	{
		err_code = rt_sem_take(usart->lock, RT_WAITING_NO);
	}
	else
	{
		err_code = rt_sem_take(usart->lock, RT_WAITING_FOREVER);
	}
	if (err_code != RT_EOK)
	{
		rt_set_errno(err_code);
		return 0;
	}

	if (dev->flag & RT_DEVICE_FLAG_INT_RX)
	{
		ptr = buffer;

		/* interrupt mode Rx */
		while (size)
		{
			rt_base_t level;
			struct efm32_usart_int_mode_t *int_rx;

			int_rx = (struct efm32_usart_int_mode_t *)\
				(((struct efm32_usart_device_t *)(dev->user_data))->rx_mode);

			/* disable interrupt */
			level = rt_hw_interrupt_disable();

			if (int_rx->read_index != int_rx->save_index)
			{
				/* read a character */
				*ptr++ = int_rx->data_ptr[int_rx->read_index];
				size--;

				/* move to next position */
				int_rx->read_index ++;
				if (int_rx->read_index >= USART_RX_BUFFER_SIZE)
				{
					int_rx->read_index = 0;
				}
			}
			else
			{
				/* set error code */
				err_code = -RT_EEMPTY;

				/* enable interrupt */
				rt_hw_interrupt_enable(level);
				break;
			}

			/* enable interrupt */
			rt_hw_interrupt_enable(level);
		}

		read_len = (rt_uint32_t)ptr - (rt_uint32_t)buffer;
	}
	else
	{
		struct efm32_usart_device_t *usart;
		USART_TypeDef *usart_device;

		usart = (struct efm32_usart_device_t *)(dev->user_data);
		usart_device = ((struct efm32_usart_device_t *)(dev->user_data))->usart_device;

		if (usart->state & USART_STATE_SYNC)
		{
			/* SPI read */
			rt_uint8_t inst_len = *((rt_uint8_t *)buffer);
			rt_uint8_t *inst_ptr = (rt_uint8_t *)(buffer + 1);
			rt_uint8_t *rx_buf = *((rt_uint8_t **)(buffer + inst_len + 1));
			rt_off_t i;

			ptr = rx_buf;

			/* write instruction */
			while (inst_len)
			{
				while (!(usart->usart_device->STATUS & USART_STATUS_TXBL));
				usart->usart_device->TXDATA = (rt_uint32_t)*inst_ptr;
				++inst_ptr; --inst_len;
			}

			/* Flushing RX */
			usart_device->CMD = USART_CMD_CLEARRX;
			/* Skip some bytes if necessary */
			for (i = 0; i < pos; i++)
			{
				/* dummy write */
				while (!(usart_device->STATUS & USART_STATUS_TXBL));
				usart_device->TXDATA = (rt_uint32_t)0xff;
				/* dummy read */
				while (!(usart_device->STATUS & USART_STATUS_RXDATAV));
				*((rt_uint32_t *)0x00) = usart_device->RXDATA;
			}

			while ((rt_uint32_t)ptr - (rt_uint32_t)rx_buf < size)
			{
				/* dummy write */
				while (!(usart_device->STATUS & USART_STATUS_TXBL));
				usart_device->TXDATA = (rt_uint32_t)0xff;
				/* read a byte of data */
				while (!(usart_device->STATUS & USART_STATUS_RXDATAV));
				*ptr = usart_device->RXDATA & 0xff;
				ptr ++;
			}
		}
		else
		{
		    rt_uint32_t flag;

            if (usart->state & USART_STATE_ASYNC_ONLY)
            {
                flag = UART_STATUS_RXDATAV;
            }
            else
            {
                flag = USART_STATUS_RXDATAV;
            }
			ptr = buffer;

			/* polling mode */
			while ((rt_uint32_t)ptr - (rt_uint32_t)buffer < size)
			{
				while (usart_device->STATUS & flag)
				{
					*ptr = usart_device->RXDATA & 0xff;
					ptr ++;
				}
			}
		}

		read_len = size;
	}

	/* Unlock device */
	rt_sem_release(usart->lock);

	/* set error code */
	rt_set_errno(err_code);
	return read_len;
}

/***************************************************************************//**
 * @brief
 *   Write to USART device
 *
 * @details
 *
 * @note
 *
 * @param[in] dev
 *   Pointer to device descriptor
 *
 * @param[in] pos
 *   Offset
 *
 * @param[in] buffer
 *   Poniter to the buffer
 *
 * @param[in] size
 *   Buffer size in byte
 *
 * @return
 *   Number of written bytes
 ******************************************************************************/
static rt_size_t rt_usart_write (
	rt_device_t 	dev,
	rt_off_t 		pos,
	const void* 	buffer,
	rt_size_t 		size)
{
	rt_err_t 						err_code;
	rt_size_t 						write_size;
	struct efm32_usart_device_t* 	usart;

	write_size = 0;
	usart = (struct efm32_usart_device_t*)(dev->user_data);

	/* Lock device */
	if (rt_hw_interrupt_check())
	{
		err_code = rt_sem_take(usart->lock, RT_WAITING_NO);
	}
	else
	{
		err_code = rt_sem_take(usart->lock, RT_WAITING_FOREVER);
	}
	if (err_code != RT_EOK)
	{
		rt_set_errno(err_code);
		return 0;
	}

	if ((dev->flag & RT_DEVICE_FLAG_DMA_TX) && (size > 2))
	{	/* DMA mode Tx */
		struct efm32_usart_dma_mode_t *dma_tx;

		if (dev->flag & RT_DEVICE_FLAG_STREAM)
		{
			if (*((rt_uint8_t *)buffer + size - 1) == '\n')
			{
				*((rt_uint8_t *)buffer + size - 1) = '\r';
				*((rt_uint8_t *)buffer + size++) = '\n';
				*((rt_uint8_t *)buffer + size) = 0;
			}
		}

		dma_tx = (struct efm32_usart_dma_mode_t *)(usart->tx_mode);
		dma_tx->data_ptr = (rt_uint32_t *)buffer;
		dma_tx->data_size = size;

		usart->state |= USART_STATE_TX_BUSY;

		DMA_ActivateBasic(
			dma_tx->dma_channel,
			true,
			false,
			(void *)&(usart->usart_device->TXDATA),
			(void *)buffer,
			(rt_uint32_t)(size - 1));

