RT-Thread/rt-thread/bsp/efm32/drv_usart.c
	/* invoke call to notify tx complete */
	if (dev->tx_complete != RT_NULL)
	{
		dev->tx_complete(dev, dma_tx->data_ptr);
	}

	/* Set status */
	usart->state &= ~(rt_uint32_t)USART_STATE_TX_BUSY;
}

/***************************************************************************//**
* @brief
*	Register USART device
*
* @details
*
* @note
*
* @param[in] device
*	Pointer to device descriptor
*
* @param[in] name
*	Device name
*
* @param[in] flag
*	Configuration flags
*
* @param[in] usart
*	Pointer to USART device descriptor
*
* @return
*	Error code
******************************************************************************/
rt_err_t rt_hw_usart_register(
	rt_device_t		device,
	const char		*name,
	rt_uint32_t		flag,
	struct efm32_usart_device_t *usart)
{
	RT_ASSERT(device != RT_NULL);

	if ((flag & RT_DEVICE_FLAG_DMA_RX) ||
		(flag & RT_DEVICE_FLAG_INT_TX))
	{
		RT_ASSERT(0);
	}

    if (usart->state & USART_STATE_SYNC)
    {
        device->type    = RT_Device_Class_SPIBUS;
    }
    else
    {
        device->type    = RT_Device_Class_Char;
    }
	device->rx_indicate = RT_NULL;
	device->tx_complete = RT_NULL;
	device->init        = rt_usart_init;
	device->open        = rt_usart_open;
	device->close       = rt_usart_close;
	device->read        = rt_usart_read;
	device->write       = rt_usart_write;
	device->control     = rt_usart_control;
	device->user_data   = usart;

	/* register a character device */
	return rt_device_register(device, name, RT_DEVICE_FLAG_RDWR | flag);
}

/***************************************************************************//**
* @brief
*	Initialize the specified USART unit
*
* @details
*
* @note
*
* @param[in] device
*	Pointer to device descriptor
*
* @param[in] unitNumber
*	Unit number
*
* @param[in] location
*	Pin location number
*
* @param[in] flag
*	Configuration flag
*
* @param[in] dmaChannel
*	DMA channel number for TX
*
* @param[in] console
*	Indicate if using as console
*
* @return
*	Pointer to USART device
******************************************************************************/
static struct efm32_usart_device_t *rt_hw_usart_unit_init(
	rt_device_t device,
	rt_uint8_t 	unitNumber,
	rt_uint8_t 	location,
	rt_uint32_t flag,
	rt_uint32_t	dmaChannel,
	rt_uint8_t 	config)
{
	struct efm32_usart_device_t 	*usart;
	struct efm32_usart_dma_mode_t	*dma_mode;
	DMA_CB_TypeDef					*callback;
	CMU_Clock_TypeDef				usartClock;
	rt_uint32_t						txDmaSelect;
	GPIO_Port_TypeDef 				port_tx, port_rx, port_clk, port_cs;
	rt_uint32_t 					pin_tx, pin_rx, pin_clk, pin_cs;
	efm32_irq_hook_init_t			hook;

	do
	{
		/* Allocate device */
		usart = rt_malloc(sizeof(struct efm32_usart_device_t));
		if (usart == RT_NULL)
		{
			usart_debug("USART%d err: no mem\n", usart->unit);
			break;
		}
		usart->counter 	= 0;
		usart->unit 	= unitNumber;
		usart->state 	= config;
		usart->tx_mode 	= RT_NULL;
		usart->rx_mode 	= RT_NULL;

		/* Allocate TX */
		dma_mode = RT_NULL;
		if (flag & RT_DEVICE_FLAG_DMA_TX)
		{
			usart->tx_mode = dma_mode = rt_malloc(sizeof(struct efm32_usart_dma_mode_t));
			if (dma_mode == RT_NULL)
			{
				usart_debug("USART%d err: no mem for DMA TX\n", usart->unit);
				break;
			}
			dma_mode->dma_channel = dmaChannel;
		}

		/* Allocate RX */
		if (flag & RT_DEVICE_FLAG_INT_RX)
		{
			usart->rx_mode = rt_malloc(sizeof(struct efm32_usart_int_mode_t));
			if (usart->rx_mode == RT_NULL)
			{
				usart_debug("USART%d err: no mem for INT RX\n", usart->unit);
				break;
			}
		}

		/* Initialization */
		if ((!(config & USART_STATE_ASYNC_ONLY) && (unitNumber >= USART_COUNT)) || \
            ((config & USART_STATE_ASYNC_ONLY) && (unitNumber >= UART_COUNT)))
		{
			break;
		}
		switch (unitNumber)
		{
		case 0:
            if (config & USART_STATE_ASYNC_ONLY)
            {
    			usart->usart_device	= UART0;
    			usartClock 			= (CMU_Clock_TypeDef)cmuClock_UART0;
    			txDmaSelect			= DMAREQ_UART0_TXBL;
    			port_tx				= AF_UART0_TX_PORT(location);
    			pin_tx 				= AF_UART0_TX_PIN(location);
    			port_rx				= AF_UART0_RX_PORT(location);
    			pin_rx 				= AF_UART0_RX_PIN(location);
            }
            else
            {
    			usart->usart_device	= USART0;
    			usartClock 			= (CMU_Clock_TypeDef)cmuClock_USART0;
    			txDmaSelect			= DMAREQ_USART0_TXBL;
    			port_tx				= AF_USART0_TX_PORT(location);
    			pin_tx 				= AF_USART0_TX_PIN(location);
    			port_rx				= AF_USART0_RX_PORT(location);
    			pin_rx 				= AF_USART0_RX_PIN(location);
    			port_clk			= AF_USART0_CLK_PORT(location);
    			pin_clk				= AF_USART0_CLK_PIN(location);
    			port_cs				= AF_USART0_CS_PORT(location);
    			pin_cs 				= AF_USART0_CS_PIN(location);
            }
			break;

		case 1:
#if defined(EFM32_GIANT_FAMILY)
            if (config & USART_STATE_ASYNC_ONLY)
            {
    			usart->usart_device	= UART1;
    			usartClock 			= (CMU_Clock_TypeDef)cmuClock_UART1;
    			txDmaSelect			= DMAREQ_UART1_TXBL;
    			port_tx				= AF_UART1_TX_PORT(location);
    			pin_tx 				= AF_UART1_TX_PIN(location);
    			port_rx				= AF_UART1_RX_PORT(location);
    			pin_rx 				= AF_UART1_RX_PIN(location);
            }
            else
#endif
            {
    			usart->usart_device	= USART1;
    			usartClock 			= (CMU_Clock_TypeDef)cmuClock_USART1;
    			txDmaSelect			= DMAREQ_USART1_TXBL;
    			port_tx				= AF_USART1_TX_PORT(location);
    			pin_tx 				= AF_USART1_TX_PIN(location);
    			port_rx				= AF_USART1_RX_PORT(location);
    			pin_rx 				= AF_USART1_RX_PIN(location);
    			port_clk			= AF_USART1_CLK_PORT(location);
    			pin_clk				= AF_USART1_CLK_PIN(location);
    			port_cs				= AF_USART1_CS_PORT(location);
    			pin_cs 				= AF_USART1_CS_PIN(location);
            }
			break;

		case 2:
			usart->usart_device	= USART2;
			usartClock 			= (CMU_Clock_TypeDef)cmuClock_USART2;
			txDmaSelect			= DMAREQ_USART2_TXBL;
			port_tx				= AF_USART2_TX_PORT(location);
			pin_tx 				= AF_USART2_TX_PIN(location);
			port_rx				= AF_USART2_RX_PORT(location);
			pin_rx 				= AF_USART2_RX_PIN(location);
			port_clk			= AF_USART2_CLK_PORT(location);
			pin_clk				= AF_USART2_CLK_PIN(location);
			port_cs				= AF_USART2_CS_PORT(location);
			pin_cs 				= AF_USART2_CS_PIN(location);
			break;

		default:
			break;
		}

		/* Enable USART clock */
		CMU_ClockEnable(usartClock, true);

		/* Config GPIO */
		GPIO_PinModeSet(
			port_tx,
			pin_tx,
			gpioModePushPull,
			0);
		GPIO_PinModeSet(
			port_rx,
			pin_rx,
			gpioModeInputPull,
			1);
		if (config & USART_STATE_SYNC)
		{
			GPIO_PinModeSet(
				port_clk,
				pin_clk,
				gpioModePushPull,
				0);
		}
		if (config & USART_STATE_AUTOCS)
		{
			GPIO_PinModeSet(
				port_cs,
				pin_cs,
				gpioModePushPull,
				1);
		}

