RT-Thread/rt-thread/bsp/efm32/drv_usart.c
		/* Config interrupt and NVIC */
		if (flag & RT_DEVICE_FLAG_INT_RX)
		{
			hook.type		= efm32_irq_type_usart;
			hook.unit		= unitNumber * 2 + 1;
            if (config & USART_STATE_ASYNC_ONLY)
            {
                hook.unit += USART_COUNT * 2;
            }
			hook.cbFunc 	= rt_hw_usart_rx_isr;
			hook.userPtr	= device;
			efm32_irq_hook_register(&hook);
		}

		/* Config DMA */
		if (flag & RT_DEVICE_FLAG_DMA_TX)
		{
			DMA_CfgChannel_TypeDef	chnlCfg;
			DMA_CfgDescr_TypeDef	descrCfg;

			hook.type 			= efm32_irq_type_dma;
			hook.unit 			= dmaChannel;
			hook.cbFunc			= rt_hw_usart_dma_tx_isr;
			hook.userPtr 		= device;
			efm32_irq_hook_register(&hook);

			callback = (DMA_CB_TypeDef *)rt_malloc(sizeof(DMA_CB_TypeDef));
			if (callback == RT_NULL)
			{
				usart_debug("USART%d err: no mem for callback\n", usart->unit);
				break;
			}
			callback->cbFunc	= DMA_IRQHandler_All;
			callback->userPtr	= RT_NULL;
			callback->primary	= 0;

			/* Setting up DMA channel */
			chnlCfg.highPri		= false;	/* Can't use with peripherals */
			chnlCfg.enableInt 	= true;		/* Interrupt for callback function */
			chnlCfg.select 		= txDmaSelect;
			chnlCfg.cb			= callback;
			DMA_CfgChannel(dmaChannel, &chnlCfg);

			/* Setting up DMA channel descriptor */
			descrCfg.dstInc 	= dmaDataIncNone;
			descrCfg.srcInc 	= dmaDataInc1;
			descrCfg.size 		= dmaDataSize1;
			descrCfg.arbRate 	= dmaArbitrate1;
			descrCfg.hprot 		= 0;
			DMA_CfgDescr(dmaChannel, true, &descrCfg);
		}

		/* Init specified USART unit */
		if (config & USART_STATE_SYNC)
		{
		    USART_InitSync_TypeDef init_sync = USART_INITSYNC_DEFAULT;

			init_sync.enable 		= usartEnable;
			init_sync.refFreq		= 0;
			init_sync.baudrate		= SPI_BAUDRATE;
			init_sync.databits 		= usartDatabits8;
			if (config & USART_STATE_MASTER)
			{
				init_sync.master 	= true;
			}
			else
			{
				init_sync.master	= false;
			}
			init_sync.msbf 			= true;
			init_sync.clockMode 	= usartClockMode0; /* Clock idle low, sample on rising edge. */
			USART_InitSync(usart->usart_device, &init_sync);
		}
		else
		{
		    USART_InitAsync_TypeDef init_async = USART_INITASYNC_DEFAULT;

			init_async.enable 		= usartEnable;
			init_async.refFreq		= 0;
			init_async.baudrate		= UART_BAUDRATE;
			init_async.oversampling	= USART_CTRL_OVS_X4;
			init_async.databits		= USART_FRAME_DATABITS_EIGHT;
			init_async.parity 		= USART_FRAME_PARITY_NONE;
			init_async.stopbits		= USART_FRAME_STOPBITS_ONE;
			USART_InitAsync(usart->usart_device, &init_async);
		}

		/* Enable RX and TX pins and set location */
		usart->usart_device->ROUTE = USART_ROUTE_RXPEN | USART_ROUTE_TXPEN | \
						(location << _USART_ROUTE_LOCATION_SHIFT);
		if (config & USART_STATE_SYNC)
		{
			usart->usart_device->ROUTE |= USART_ROUTE_CLKPEN;
		}
		if (config & USART_STATE_AUTOCS)
		{
			usart->usart_device->ROUTE |= USART_ROUTE_CSPEN;
			if (config & USART_STATE_MASTER)
			{
				usart->usart_device->CTRL |= USART_CTRL_AUTOCS;
			}
		}

		/* Clear RX/TX buffers */
		usart->usart_device->CMD = USART_CMD_CLEARRX | USART_CMD_CLEARTX;

		return usart;
	} while(0);

	if (usart->rx_mode)
	{
		rt_free(usart->rx_mode);
	}
	if (usart->tx_mode)
	{
		rt_free(usart->tx_mode);
	}
	if (usart)
	{
		rt_free(usart);
	}
	if (callback)
	{
		rt_free(usart);
	}

    if (config & USART_STATE_ASYNC_ONLY)
    {
        usart_debug("UART%d err: init failed!\n", unitNumber);
    }
    else
    {
        usart_debug("USART%d err: init failed!\n", unitNumber);
    }
	return RT_NULL;
}

/***************************************************************************//**
* @brief
*   Initialize all USART module related hardware and register USART device to
* kernel
*
* @details
*
* @note
******************************************************************************/
void rt_hw_usart_init(void)
{
	struct efm32_usart_device_t	*usart;
	rt_uint32_t 				flag;
	rt_uint8_t					config;

	do
	{
#ifdef RT_USING_USART0
		config = 0x00;
		flag = RT_DEVICE_FLAG_RDWR;

 #ifdef RT_USART0_SYNC_MODE
		config |= USART_STATE_SYNC;
  #if (RT_USART0_SYNC_MODE != 0x0UL)
		config |= USART_STATE_MASTER;
  #else
		 flag |= RT_DEVICE_FLAG_INT_RX;
  #endif
 #else
		 flag |= RT_DEVICE_FLAG_INT_RX;
 #endif

 #if (SPI_AUTOCS_ENABLE & (1 << 0))
		config |= USART_STATE_AUTOCS;
 #endif

 #if (RT_CONSOLE_DEVICE == EFM_USART0)
		config |= USART_STATE_CONSOLE;
		flag |= RT_DEVICE_FLAG_STREAM;
 #endif

 #ifdef RT_USART0_USING_DMA
	 	RT_ASSERT(RT_USART0_USING_DMA < DMA_CHAN_COUNT);
		flag |= RT_DEVICE_FLAG_DMA_TX;
 #else
	   #define RT_USART0_USING_DMA EFM32_NO_DMA
 #endif

		/* Initialize and Register usart0 */
		if ((usart = rt_hw_usart_unit_init(
			&usart0_device,
			0,
			RT_USING_USART0,
			flag,
			RT_USART0_USING_DMA,
			config)) != RT_NULL)
		{
			rt_hw_usart_register(&usart0_device, RT_USART0_NAME, flag, usart);
		}
		else
		{
			break;
		}
		/* Initialize lock for usart0 */
		usart->lock = &usart0_lock;
		if (rt_sem_init(usart->lock, RT_USART0_NAME, 1, RT_IPC_FLAG_FIFO) != RT_EOK)
		{
			break;
		}
#endif

#ifdef RT_USING_USART1
		config = 0x00;
		flag = RT_DEVICE_FLAG_RDWR;

 #ifdef RT_USART1_SYNC_MODE
		config |= USART_STATE_SYNC;
  #if (RT_USART1_SYNC_MODE != 0x0UL)
		config |= USART_STATE_MASTER;
  #else
		 flag |= RT_DEVICE_FLAG_INT_RX;
  #endif
 #else
		 flag |= RT_DEVICE_FLAG_INT_RX;
 #endif

 #if (SPI_AUTOCS_ENABLE & (1 << 1))
		config |= USART_STATE_AUTOCS;
 #endif

 #if (RT_CONSOLE_DEVICE == EFM_USART1)
		config |= USART_STATE_CONSOLE;
		flag |= RT_DEVICE_FLAG_STREAM;
 #endif

 #ifdef RT_USART1_USING_DMA
	 	RT_ASSERT(RT_USART1_USING_DMA < DMA_CHAN_COUNT);
		flag |= RT_DEVICE_FLAG_DMA_TX;
 #else

	   #define RT_USART1_USING_DMA EFM32_NO_DMA
 #endif

 		/* Initialize and Register usart1 */
		if ((usart = rt_hw_usart_unit_init(
			&usart1_device,
			1,
			RT_USING_USART1,
			flag,
			RT_USART1_USING_DMA,
			config)) != RT_NULL)
		{
			rt_hw_usart_register(&usart1_device, RT_USART1_NAME, flag, usart);
		}
		else
		{
			break;
		}
		/* Initialize lock for usart1 */
		usart->lock = &usart1_lock;
		if (rt_sem_init(usart->lock, RT_USART1_NAME, 1, RT_IPC_FLAG_FIFO) != RT_EOK)
		{
			break;
		}
#endif

