RT-Thread/rt-thread/bsp/efm32/drv_usart.c
#ifdef RT_USING_USART2
		config = 0x00;
		flag = RT_DEVICE_FLAG_RDWR;

 #ifdef RT_USART2_SYNC_MODE
		config |= USART_STATE_SYNC;
  #if (RT_USART2_SYNC_MODE != 0x0UL)
		config |= USART_STATE_MASTER;
  #else
		flag |= RT_DEVICE_FLAG_INT_RX;
  #endif
 #else
		flag |= RT_DEVICE_FLAG_INT_RX;
 #endif

#if (SPI_AUTOCS_ENABLE & (1 << 2))
		config |= USART_STATE_AUTOCS;
#endif

#if (RT_CONSOLE_DEVICE == EFM_USART2)
		config |= USART_STATE_CONSOLE;
		flag |= RT_DEVICE_FLAG_STREAM;
#endif

 #ifdef RT_USART2_USING_DMA
	 	RT_ASSERT(RT_USART2_USING_DMA < DMA_CHAN_COUNT);
		flag |= RT_DEVICE_FLAG_DMA_TX;

 #else

	   #define RT_USART2_USING_DMA EFM32_NO_DMA
 #endif

		/* Initialize and Register usart2 */
		if ((usart = rt_hw_usart_unit_init(
			&usart2_device,
			2,
			RT_USING_USART2,
			flag,
			RT_USART2_USING_DMA,
			config)) != RT_NULL)
		{
			rt_hw_usart_register(&usart2_device, RT_USART2_NAME, flag, usart);
		}
		else
		{
			break;
		}
		/* Initialize lock for usart2 */
		usart->lock = &usart2_lock;
		if (rt_sem_init(usart->lock, RT_USART2_NAME, 1, RT_IPC_FLAG_FIFO) != RT_EOK)
		{
			break;
		}
#endif

#ifdef RT_USING_UART0
        config = USART_STATE_ASYNC_ONLY;
        flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;

 #if (RT_CONSOLE_DEVICE == EFM_UART0)
        config |= USART_STATE_CONSOLE;
        flag |= RT_DEVICE_FLAG_STREAM;
 #endif

 #ifdef RT_UART0_USING_DMA
        RT_ASSERT(RT_UART0_USING_DMA < DMA_CHAN_COUNT);
        flag |= RT_DEVICE_FLAG_DMA_TX;
 #else
       #define RT_UART0_USING_DMA EFM32_NO_DMA
 #endif

        /* Initialize and Register uart0 */
        if ((usart = rt_hw_usart_unit_init(
            &uart0_device,
            0,
            RT_USING_UART0,
            flag,
            RT_UART0_USING_DMA,
            config)) != RT_NULL)
        {
            rt_hw_usart_register(&uart0_device, RT_UART0_NAME, flag, usart);
        }
        else
        {
            break;
        }
        /* Initialize lock for uart0 */
        usart->lock = &uart0_lock;
        if (rt_sem_init(usart->lock, RT_UART0_NAME, 1, RT_IPC_FLAG_FIFO) != RT_EOK)
        {
            break;
        }
#endif

#ifdef RT_USING_UART1
        config = USART_STATE_ASYNC_ONLY;
        flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;

 #if (RT_CONSOLE_DEVICE == EFM_UART1)
        config |= USART_STATE_CONSOLE;
        flag |= RT_DEVICE_FLAG_STREAM;
 #endif

 #ifdef RT_UART1_USING_DMA
        RT_ASSERT(RT_UART1_USING_DMA < DMA_CHAN_COUNT);
        flag |= RT_DEVICE_FLAG_DMA_TX;
 #else
       #define RT_UART1_USING_DMA EFM32_NO_DMA
 #endif

        /* Initialize and Register uart1 */
        if ((usart = rt_hw_usart_unit_init(
            &uart1_device,
            1,
            RT_USING_UART1,
            flag,
            RT_UART1_USING_DMA,
            config)) != RT_NULL)
        {
            rt_hw_usart_register(&uart1_device, RT_UART1_NAME, flag, usart);
        }
        else
        {
            break;
        }
        /* Initialize lock for uart1 */
        usart->lock = &uart1_lock;
        if (rt_sem_init(usart->lock, RT_UART1_NAME, 1, RT_IPC_FLAG_FIFO) != RT_EOK)
        {
            break;
        }
#endif

		usart_debug("USART: H/W init OK!\n");
		return;
	} while (0);

	rt_kprintf("USART: H/W init failed!\n");
}

#endif /* (defined(RT_USING_USART0) || defined(RT_USING_USART1) || \
    defined(RT_USING_USART2) || defined(RT_USING_UART0) || \
    defined(RT_USING_UART1)) */
/***************************************************************************//**
 * @}
 ******************************************************************************/
